{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "0da70579-e671-4f46-acc7-1292d65e519b",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-07-31T19:00:16.7892753Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-07-31T19:12:36.366765Z",
  "displayName": "compliance 2",
  "version": 2,
  "passcodeBlockSimple": false,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": null,
  "passcodeMinutesOfInactivityBeforeLock": null,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passcodeRequiredType": "deviceDefault",
  "passcodeRequired": false,
  "osMinimumVersion": "12",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "restrictedApps": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments": [],
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')",
      "id": "0da70579-e671-4f46-acc7-1292d65e519b",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionConfigurations('6dcc01de-e3c8-4017-8106-28b0e38a09b3')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionsForRule('0da70579-e671-4f46-acc7-1292d65e519b')/scheduledActionConfigurations('6dcc01de-e3c8-4017-8106-28b0e38a09b3')",
          "id": "6dcc01de-e3c8-4017-8106-28b0e38a09b3",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.iosCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('0da70579-e671-4f46-acc7-1292d65e519b')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
