{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "@odata.id": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')",
  "@odata.editLink": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "af05a47b-fb44-46d5-9ef2-b96542d3b240",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-07-31T19:00:35.6272239Z",
  "description": null,
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2025-07-31T19:00:35.6272239Z",
  "displayName": "compliance 3",
  "version": 1,
  "passcodeBlockSimple": false,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": null,
  "passcodeMinutesOfInactivityBeforeLock": null,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType@odata.type": "#microsoft.graph.requiredPasswordType",
  "passcodeRequiredType": "deviceDefault",
  "passcodeRequired": false,
  "osMinimumVersion": "13",
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel@odata.type": "#microsoft.graph.deviceThreatProtectionLevel",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps@odata.type": "#Collection(microsoft.graph.appListItem)",
  "restrictedApps": [],
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/assignments",
  "assignments": [],
  "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
  "scheduledActionsForRule@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule/$ref",
  "scheduledActionsForRule@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule",
  "scheduledActionsForRule": [
    {
      "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
      "@odata.id": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')",
      "@odata.editLink": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')",
      "id": "af05a47b-fb44-46d5-9ef2-b96542d3b240",
      "ruleName": null,
      "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionConfigurations",
      "scheduledActionConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionConfigurations/$ref",
      "scheduledActionConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionConfigurations",
      "scheduledActionConfigurations": [
        {
          "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
          "@odata.id": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionConfigurations('350e8479-f7c3-4e41-b16d-2c65a2f0f20f')",
          "@odata.editLink": "deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionsForRule('af05a47b-fb44-46d5-9ef2-b96542d3b240')/scheduledActionConfigurations('350e8479-f7c3-4e41-b16d-2c65a2f0f20f')",
          "id": "350e8479-f7c3-4e41-b16d-2c65a2f0f20f",
          "gracePeriodHours": 0,
          "actionType@odata.type": "#microsoft.graph.deviceComplianceActionType",
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList@odata.type": "#Collection(String)",
          "notificationMessageCCList": []
        }
      ]
    }
  ],
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/deviceStatusOverview",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.iosCompliancePolicy/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.assign"
  },
  "#microsoft.graph.scheduleActionsForRules": {
    "title": "microsoft.graph.scheduleActionsForRules",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceCompliancePolicies('af05a47b-fb44-46d5-9ef2-b96542d3b240')/microsoft.graph.deviceCompliancePolicy/microsoft.graph.scheduleActionsForRules"
  }
}
