{
     "@odata.type": "#microsoft.graph.iosCompliancePolicy",
     "roleScopeTagIds": [
          "Default"
     ],
     "description": null,
     "displayName": "compliance 4",
     "passcodeBlockSimple": false,
     "passcodeExpirationDays": null,
     "passcodeMinimumLength": null,
     "passcodeMinutesOfInactivityBeforeLock": null,
     "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
     "passcodePreviousPasscodeBlockCount": null,
     "passcodeMinimumCharacterSetCount": null,
     "passcodeRequiredType": "deviceDefault",
     "passcodeRequired": false,
     "osMinimumVersion": "13",
     "osMaximumVersion": null,
     "osMinimumBuildVersion": null,
     "osMaximumBuildVersion": null,
     "securityBlockJailbrokenDevices": false,
     "deviceThreatProtectionEnabled": false,
     "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
     "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
     "managedEmailProfileRequired": false,
     "restrictedApps": [],
     "scheduledActionsForRule": [
          {
               "ruleName": null,
               "scheduledActionConfigurations": [
                    {
                         "gracePeriodHours": 0,
                         "actionType": "block",
                         "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                         "notificationMessageCCList": []
                    }
               ]
          }
     ]
}